Cases/palette/palette_6x4/system/boxes/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

T
{
    internalField   uniform 270;

    boundaryField
    {
        bottom // face to ground
        {
            type            zeroGradient;         
        }
        symmetryPlanes
        {
			type            symmetry;
        }
        "boxes_to_.*"
        {
            type            compressible::turbulentTemperatureCoupledBaffleMixed;
            Tnbr            T;
            kappaMethod     solidThermo;
            value           $internalField;
        }
    }
}

p
{
    internalField   uniform 100000;

    boundaryField
    {
		symmetryPlanes
        {
			type            symmetry;
        }
    }
}

// ************************************************************************* //
